/*******************************************************************************
                          C++ 标准库
            1. 标准函数库
            2. 面向对象类库

      ***** C++ 标准库的内容总共在50个标准头文件中定义

链接：
https://www.cnblogs.com/lsgxeva/p/7696499.html

*******************************************************************************/
/*
1. 标准函数库 (10类)
   <1> 语言支持
      a. <new> 支持动态内存分配

   <2> 输入/输出  I/O
      a. <iostream>     支持标准流cin、cout、cerr、clog 的输入和输出
      b. <iomanip>      提供操纵程序，允许改变流的状态，从而改变输出的格式
      c. <sstream>      支持字符串的流输入输出
      d. <fstream>      支持文件的流输入输出

   <3> 诊断功能
   <4> 通用工具
      a. <ctime>       支持系统时钟函数


   <5> 字符串可字符处理
      a. <string>      为字符串类型提供支持和定义

   <6> 容器
      a. <vector>     定义vector序列模板， 这是一个大小可以重新设置的数组类型，比普通数组更安全、灵活

   <7> 迭代器
      a. <iterator>   给迭代器提供定义和支持

   <8> 算法
      a. <algorithm>  提供一组基于算法的函数，包括置换、排序、合并和搜索
      b. <cstdlib>    声明C标准库函数bsearch() 和 qsort(), 进行搜索和排序

   <9> 数值操作
      a. <complex>    支持复杂数值的定义和操作
      b. <valarray>   支持数值适量的操作
      c. <cmath>      C数学库
      d. <cstdlib>    提供的函数可以提取整数的绝对值，对整数进行取余数操作


   <10> 时间、日期和本地化
*/


/*
2. 面向对象类库
   <1> 标准的C++ I/O类
   <2> String 类
   <3> 数值类
   <3> STL 容器类
   <4> STL 算法类
   <5> STL 函数对象
   <6> STL 迭代器
   <7> STL 分配器
   <8> 本地化库
   <9> 异常处理类
   <10> 杂项支持类
**/




////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************
                  C++ 标准模板库 STL
            STL 广义上分为三类：
            1. 算法（algorithm)
            2. 容器 (container)
            3. 迭代器 (iterator)

*******************************************************************************/
