/*******************************************************************************
                              指针
     参考资料： 让你不再害怕指针 —— C 指针详解
             https://blog.csdn.net/soonfly/article/details/51131141


*******************************************************************************/
////////////////////////////////////////////////////////////////////////////////
/*

 复杂类型说明
    1. int p;                   // p是整型变量
    2. int *p；                 // p是返回整型数据的指针
    3. int p[3];                // p是由整型数据组成的数组
    4. int *p[3];               // p是由返回整型数据的指针组成的数组   PS：指针数组
    5. int (*p)[3];             // p是指向由整型数据组成的数组的指针   PS: 数组指针
    6. int **p;                 // 二级指针
    7. int p(int);              // p是函数，带有一个整型形参， 函数返回一个整型数据
    8. int (*p)(int)；          // 函数指针
    9. int *(*p(int))[3];       //


一. 细说指针

























*/
