/******************************************************************************
                       C++ 数组
      1. 数组用来存储一系列 相同类型 的变量
      2. 所有的数组都是由连续的内存位置组成的
      3. 数组声明： type arrayName [arraySize]

*******************************************************************************/

////////////////////////////////////////////////////////////////////////////////
//// 1. 一维数组的初始化
/*
    int array[3] = {};         //全部初始化为0
    int array[3] = {1, 2, 3};  //分别赋值
    int array[]  = {1,2,3};    //自动识别长度

*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
////  2. 多维数组： type name[size1][size2]...[sizeN];
/*
     int data[2][3] = { {1,2,3},
                        {2,3,4} };
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
////  3. 指向数组的指针



////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
////  4. 传递数组给数组
///  C++ 传数组给一个函数，数组类型自动转换为指针类型，因而传的实际是地址
///  3种方式声明函数：
///
// 方式1：形式参数是一个指针
/*
     void myFunc(int *param)
     {
        ....
     }

*/

// 方式2：形式参数是一个已定义大小的数组
/*   void myFunc(int param[10])
     {
       .....
     }

// 方式3： 形式参数是一个未定义大小的数组
   void myFunc(int param[])
   {
     ....
   }
*/
//------------------------------------------------------------------------------
#if 1

#include<iostream>
using namespace std;

double getAverage(int arr[], int size);

int main()
{
  int balance[5] = {100, 2, 3, 17, 50};
  double ave;

  ave = getAverage(balance, 5);

  cout<<"平均值是："<< ave << endl;

  return 0;
}

double getAverage(int arr[], int size)
{
  double sum = 0.0;
  double ave = 0.0;

  for(int i=0; i<size; i++)
  {
    sum += arr[i];
  }

  ave = double (sum)/size;

  return ave;
}

#endif

////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
////   5. 从函数返回数组
/// C++ 不允许返回一个完整的数组作为函数的参数。但是可以指定不带索引的数组名来返回一个指向数组的指针


////////////////////////////////////////////////////////////////////////////////
