#!/bin/bash

# 这是我的bash学习笔记！

echo "Hello world!"


:<<!
##_________________________________________________
##                变量

yourname="runoob.com"   ## = 前后不能有空格
echo ${yourname}
echo ${#yourname}       ## 输出字符长度


##__________________________________________________
##               数组

array=("a","b","d", "e")
length=${#array[*]}

for ((i=0; i<length; i++)); do
    echo ${array[i]}
done


##__________________________________________________
##               使用循环
for file in $(ls /etc);do
      ls -l /etc
done
!

##_________________________________________________
##             多行注释
:<<!
注释内容
注释内容
注释内容
...
...
!



#__________________________________________________
#             Shell 传递参数

echo "Shell 传递参数实例！"；
echo "执行的文件名: $0";
echo "第一个参数为: $1";
echo "第二个参数为: $2";
echo "第三个参数为: $3";

echo "参数的个数：$#";
echo "传递的参数作为字符串显示: $*";
echo "脚本运行的当前ID号: $$"

for i in "$*"; do
    echo $i;
done















