###  台式机IP： 166.111.27.69     2018-04-19
#### 需要知道远程文件夹的路径，主机名称，ip及密码
#### 需要注意的是，每次重启后，电脑都会重新分配IP地址


###  1、远程登录： 
       ssh gfh16@166.111.27.157  （查看主机IP: ifconfig ）
                    
###  2、从远程机器(主机名：gfh16, IP:166.111.27.157）/home路径下载文件 123 到本机（主机名：sea）
       scp  gfh16@166.111.27.157:/home/gfh16/123 ~/              (下载到本机的/home)
       scp  gfh16@166.111.27.157:/home/gfh16/123 /home/sea/11/   (下载到指定文件夹)
       
###  3、从本机上传文件到远程机器
        scp /home/sea/123 gfh16@166.111.27.157:/home/gfh16/11/
        
###  4、从远程机器(主机名：gfh16, IP:166.111.27.157）/home路径下载文件夹 11 到本机（主机名：sea）
       scp -r gfh16@166.111.27.157:/home/gfh16/11/  ~/              (下载到本机的/home)
       scp -r gfh16@166.111.27.157:/home/gfh16/11/ /home/sea/11/   (下载到指定文件夹)
       
###  5、从本机上传文件到远程机器
        scp -r /home/sea/11/ gfh16@166.111.27.157:/home/gfh16/
